stress-tests/artillery-quick.yml
# Prueba rápida de estrés (menos tiempo, menos carga)
# Útil para validar que el entorno responde antes de una prueba larga.
# Ejecutar: npx artillery run stress-tests/artillery-quick.yml

config:
  target: "{{ $environment.baseUrl || 'http://localhost:3000' }}"
  phases:
    - duration: 20
      arrivalRate: 10
      name: "Quick load"
  variables:
    username: "{{ $environment.username || 'admin' }}"
    password: "{{ $environment.password || 'admin123' }}"
  timeout: 15

scenarios:
  - name: "Login"
    flow:
      - post:
          url: "/auth/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/dashboard/stats"
          expect:
            - statusCode: 200